10/data/attachments/ae8e895c7463d318.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Alan_yes_Friend_2431_3</nif:username>
            <nif:friendToBeRequested>soap_friends_6d553ce9-cb50-40df-a0db-649e302c6661</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>